//@formatter:off
/**
 ******************************************************************************
 * @file        AjaxResBaseEntity.java
 * @brief       Ajax通信のレスポンスエンティティ
 * @par         
 * @author      CSC
 * $Id:         $
 * @attention  
 *
 * Copyright (c) 2016 MURATA MACHINERY,LTD. All rights reserved.
 *
 * @note        Tabstop=4
 * ----------------------------------------------------------------------------
 * DATE       VER.        DESCRIPTION                                    AUTHOR
 * ----------------------------------------------------------------------------
 * 2016/12/26 0.1         Step1リリース                                     CSC
 ******************************************************************************
 */
//@formatter:on
package net.muratec.mcs.entity.common;

//@formatter:off
/**
 ******************************************************************************
 * @brief     Ajax通信でのレスポンスのエンティティ
 * @par      Ajax通信でのレスポンスのエンティティの基底クラス。
 *           Ajaxでやり取りする部分のレスポンスエンティティは全てこのクラスを継承すること。
 * @attention 
 * @note      
 * ----------------------------------------------------------------------------
 * VER.        DESCRIPTION                                               AUTHOR
 * ----------------------------------------------------------------------------
 ******************************************************************************
 */
//@formatter:on
public class AjaxResBaseEntity {

    // ------------------------------------
    // Ajaxの結果
    // ------------------------------------
    public AjaxResultEntity result = new AjaxResultEntity();
}
