//@formatter:off
/**
 ******************************************************************************
 * @file        DbConfigEntity.java
 * @brief       DB接続情報エンティティ
 * @par         
 * @author      CSC
 * $Id:         $
 * @attention  
 *
 * Copyright (c) 2016 MURATA MACHINERY,LTD. All rights reserved.
 *
 * @note        Tabstop=4
 * ----------------------------------------------------------------------------
 * DATE       VER.        DESCRIPTION                                    AUTHOR
 * ----------------------------------------------------------------------------
 * 2016/12/26 0.1         Step1リリース                                     CSC
 ******************************************************************************
 */
//@formatter:on
package net.muratec.mcs.entity.common;

//@formatter:off
/**
 ******************************************************************************
 * @brief     DB接続情報エンティティ
 * @par      McsDataTables用のDB接続情報エンティティの基底クラス。
 * @attention 
 * @note      
 * ----------------------------------------------------------------------------
 * VER.        DESCRIPTION                                               AUTHOR
 * ----------------------------------------------------------------------------
 ******************************************************************************
 */
//@formatter:on
public class DbConfigEntity {

    // ------------------------------------
    // URL
    // ------------------------------------
    public String url = null;

    // ------------------------------------
    // ユーザ名
    // ------------------------------------
    public String username = null;

    // ------------------------------------
    // パスワード
    // ------------------------------------
    public String password = null;

    // ------------------------------------
    // JDBC Driver Name
    // ------------------------------------
    public String driverClassName = null;

    // ------------------------------------
    // 自動コミットフラグ
    // ------------------------------------
    public boolean autoCommit = true;
}
