//@formatter:off
/**
 ******************************************************************************
 * @file        MsgResult.java
 * @brief       メッセージ結果クラス
 * @par
 * @author      T.Iga/CSC
 * $Id:         $
 * @attention
 *
 * Copyright (c) 2016 MURATA MACHINERY,LTD. All rights reserved.
 *
 * @note        Tabstop=4
 * ----------------------------------------------------------------------------
 * DATE       VER.        DESCRIPTION                                    AUTHOR
 * ----------------------------------------------------------------------------
 * 2017/09/20 0.5         Step4リリース                               T.Iga/CSC
 ******************************************************************************
 */
//@formatter:on
package net.muratec.mcs.model;

import java.util.ArrayList;

//@formatter:off
/**
 ******************************************************************************
 * @brief  メッセージ結果クラス
 * @par    制御プロセスとのメッセージ結果を格納
 * @note
 * ----------------------------------------------------------------------------
 * VER.        DESCRIPTION                                               AUTHOR
 * ----------------------------------------------------------------------------
 ******************************************************************************
 */
//@formatter:on
public class MsgResult {

    // 定数
    // ! 処理結果：正常
    public static final int k_nResultOK = 0;
    // ! 処理結果：異常
    public static final int k_nResultNG = -1;

    // メンバ変数

    // ! 処理結果
    private int m_nResult = k_nResultOK;
    // ! 受信メッセージ
    private MsgData m_msgData = null;
    // ! 受信メッセージ(複数) - TODO
    private ArrayList<MsgData> m_aryDataList = new ArrayList<MsgData>();

    //@formatter:off
    /**
     ******************************************************************************
     * @brief  コンストラクタ
     * @par    デフォルトコンストラクタ
     * @param  なし
     * @note
     * ----------------------------------------------------------------------------
     * VER.        DESCRIPTION                                               AUTHOR
     * ----------------------------------------------------------------------------
     ******************************************************************************
     */
    //@formatter:on
    public MsgResult() {
    }

    //@formatter:off
    /**
     ******************************************************************************
     * @brief  結果取得
     * @par    メッセージ送受信の結果を取得
     * @param  なし
     * @return 結果
     * @retval 0 成功
     * @retval 1 失敗
     * @note   メッセージ送受信の結果を取得
     * ----------------------------------------------------------------------------
     * VER.        DESCRIPTION                                               AUTHOR
     * ----------------------------------------------------------------------------
     ******************************************************************************
     */
    //@formatter:on
    public int getResult() {

        return m_nResult;
    }

    //@formatter:off
    /**
     ******************************************************************************
     * @brief  結果設定
     * @par    メッセージ送受信の結果を設定
     * @param  nResult 結果
     * @return 戻り値なし
     * @note   メッセージ送受信の結果を設定
     * ----------------------------------------------------------------------------
     * VER.        DESCRIPTION                                               AUTHOR
     * ----------------------------------------------------------------------------
     ******************************************************************************
     */
    //@formatter:on
    public void setResult(int nResult) {

        this.m_nResult = nResult;
    }

    //@formatter:off
    /**
     ******************************************************************************
     * @brief  メッセージデータ取得
     * @par    メッセージデータを取得
     * @param  なし
     * @return メッセージデータ
     * @note   制御プロセスからのメッセージデータを取得
     * ----------------------------------------------------------------------------
     * VER.        DESCRIPTION                                               AUTHOR
     * ----------------------------------------------------------------------------
     ******************************************************************************
     */
    //@formatter:on
    public MsgData getMsgData()
    {
        return m_msgData;
    }

    //@formatter:off
    /**
     ******************************************************************************
     * @brief  メッセージデータ設定
     * @par    メッセージデータを設定
     * @param  msgData メッセージデータ
     * @return 戻り値なし
     * @note   制御プロセスからのメッセージデータを設定
     * ----------------------------------------------------------------------------
     * VER.        DESCRIPTION                                               AUTHOR
     * ----------------------------------------------------------------------------
     ******************************************************************************
     */
    //@formatter:on
    public void setMsgData(MsgData msgData) {

        this.m_msgData = msgData;
    }

    //@formatter:off
    /**
     ******************************************************************************
     * @brief  メッセージデータ追加
     * @par    メッセージデータを追加
     * @param  msgData メッセージデータ
     * @return 戻り値なし
     * @note   メッセージデータをリストに追加
     * ----------------------------------------------------------------------------
     * VER.        DESCRIPTION                                               AUTHOR
     * ----------------------------------------------------------------------------
     ******************************************************************************
     */
    //@formatter:on
    public void addMsgDataList(MsgData msgData) {

        this.m_aryDataList.add(msgData);
    }

    //@formatter:off
    /**
     ******************************************************************************
     * @brief  メッセージデータリスト取得
     * @par    メッセージデータリストを取得
     * @param  なし
     * @return メッセージデータリスト
     * @note   メッセージデータリストを取得
     * ----------------------------------------------------------------------------
     * VER.        DESCRIPTION                                               AUTHOR
     * ----------------------------------------------------------------------------
     ******************************************************************************
     */
    //@formatter:on
    public ArrayList<MsgData> getMsgDataList() {

        return this.m_aryDataList;
    }
}
